perf/space_news.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555/api'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - pause: 10
    - name: Ramp
      duration: 840
      arrivalRate: 5
      rampTo: 300
    - name: Plain
      duration: 60
      arrivalRate: 300
    - pause: 60
    - name: Endurance
      duration: 3600
      arrivalRate: 50
    - pause: 60
    


scenarios:
  - name: Space news (/space_news)
    flow:
      - get: 
          url: '/space_news'